# running in dma_engine_prove/src/
read -formal dma_engine_formal.sv
read -formal dma_engine.v
prep -top dma_engine_formal
setundef -init -zero

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
