# running in global_cmd_processor_cover/src/
read -formal global_cmd_processor_formal.sv
read -formal global_cmd_processor.v
prep -top global_cmd_processor_formal
setundef -init -zero

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
